# Start Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkIterator..::..Start Method
MEPNetworkIterator Class See Also
---
Gets the first step of network iteration.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public void Start()
```

Visual Basic
---
```text
Public Sub Start
```

Visual C++
---
```text
public:
void Start()
```

# Remarks
The first step may not contain any analytical segment, but the first analytical node.
# See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace